<a href="https://colab.research.google.com/github/SManeesha2007/IIY-IIIS-CPP/blob/main/FDS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

UNIT-1,2

In [ ]:
import pandas as pd
data={'ID':[101,102,103,104,105],'Name':['Alice','Bob','Charlie','David','Eve'],'Age':[25,None,29,33,None],'salary':[55000,48000,None,62000,None]}
df=pd.DataFrame(data)
print(df)
#remove rows with missing values
print("removing rows with missing values.................")
df_cleaned=df.dropna()
print(df_cleaned)

    ID     Name   Age   salary
0  101    Alice  25.0  55000.0
1  102      Bob   NaN  48000.0
2  103  Charlie  29.0      NaN
3  104    David  33.0  62000.0
4  105      Eve   NaN      NaN
removing rows with missing values.................
    ID   Name   Age   salary
0  101  Alice  25.0  55000.0
3  104  David  33.0  62000.0

In [ ]:
for column in df.columns:
  if df[column].dtype=='float64' or df[column].dtype=='int64':
    df[column].fillna(df[column].mean(),inplace=True)
print(df)

    ID     Name   Age   salary
0  101    Alice  25.0  55000.0
1  102      Bob  29.0  48000.0
2  103  Charlie  29.0  55000.0
3  104    David  33.0  62000.0
4  105      Eve  29.0  55000.0

/tmp/ipython-input-753587688.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[column].fillna(df[column].mean(),inplace=True)

In [ ]:
for column in df.columns:
  if df[column].isnull().any():
    df[f'(column)_Flag']=df[column].isna().apply(lambda x:'Missing' if x else 'Not Missing')
df['Missing_Flag']=df.isnull().any(axis=1).apply(lambda x:'Missing' if x else 'Not Missing')
print(df)

    ID     Name   Age   salary Missing_Flag
0  101    Alice  25.0  55000.0  Not Missing
1  102      Bob  29.0  48000.0  Not Missing
2  103  Charlie  29.0  55000.0  Not Missing
3  104    David  33.0  62000.0  Not Missing
4  105      Eve  29.0  55000.0  Not Missing

In [ ]:
import pandas as pd
data={'ID':[101,102,103,104,102,106,101],'Name':['Alice','Bob','Charlie','David','Bob','Alice','Alicia'],'Age':[25,29,29,33,29,27,25],'salary':[55000,48000,55000,62000,48000,59000,55000],'City':['NY','LA','NY','SF','LA','LA','NY']}
df=pd.DataFrame(data)
print("Original Dataset")
print(df,'\n')

df_cleaned=df.drop_duplicates()
print("Duplicates Removed -Exact Match")
print(df_cleaned,'\n')

#partial Match -based on specific columns only
df_cleaned_id=df.drop_duplicates(subset=['ID'])
print("Duplicates Removed -partial Match based on ID")
print(df_cleaned_id,'\n')

df_cleaned_name=df.drop_duplicates(subset=['Name'])
print("Duplicates Removed -partial Match based on Name")
print(df_cleaned_name,'\n')

df_cleaned_specific=df.drop_duplicates(subset=['ID','Name'])
print("Duplicates Removed -partial Match based on ID,Name")
print(df_cleaned_specific,'\n')

Original Dataset
    ID     Name  Age  salary City
0  101    Alice   25   55000   NY
1  102      Bob   29   48000   LA
2  103  Charlie   29   55000   NY
3  104    David   33   62000   SF
4  102      Bob   29   48000   LA
5  106    Alice   27   59000   LA
6  101   Alicia   25   55000   NY

Duplicates Removed -Exact Match
    ID     Name  Age  salary City
0  101    Alice   25   55000   NY
1  102      Bob   29   48000   LA
2  103  Charlie   29   55000   NY
3  104    David   33   62000   SF
5  106    Alice   27   59000   LA
6  101   Alicia   25   55000   NY

Duplicates Removed -partial Match based on ID
    ID     Name  Age  salary City
0  101    Alice   25   55000   NY
1  102      Bob   29   48000   LA
2  103  Charlie   29   55000   NY
3  104    David   33   62000   SF
5  106    Alice   27   59000   LA

Duplicates Removed -partial Match based on Name
    ID     Name  Age  salary City
0  101    Alice   25   55000   NY
1  102      Bob   29   48000   LA
2  103  Charlie   29   55000   NY
3  104    David   33   62000   SF
6  101   Alicia   25   55000   NY

Duplicates Removed -partial Match based on ID,Name
    ID     Name  Age  salary City
0  101    Alice   25   55000   NY
1  102      Bob   29   48000   LA
2  103  Charlie   29   55000   NY
3  104    David   33   62000   SF
5  106    Alice   27   59000   LA
6  101   Alicia   25   55000   NY

UNIT-3

In [ ]:
f1=open("myfile.txt","w")
L=["This is delhi\n","This is paris\n","This is London\n"]
f1.write("Hello\n")
f1.writelines(L)
f1.close()
f1=open("myfile.txt","r+")
print("Output of read() :")
print(f1.read())
print()

f1.seek(0)
print("Output of readline():")
print(f1.readline())
print()

f1.seek(0)
print("Output of read(9) :")
print(f1.read(9))
print()

Output of read() :
Hello
This is delhi
This is paris
This is London


Output of readline():
Hello


Output of read(9) :
Hello
Thi

In [ ]:
[
    {
        "id":1,
        "name":"Ravi",
        "address":{
            "city":"Hyderabad","state":"Telanagana"
        }
        "marks":{
            "math":85,
            "science":90
        }
    },
    {
        "id":2,
        "name":"priya",
        "address":{
            "city":"Chennai","state":"Tamil Nadu"
        }
        "marks":{
            "math":92,
            "science":88
        }
    }
]